tests/stress_test/load-test.yml
config:
    target: http://127.0.0.1:3000
    phases:
        - duration: 1
          arrivalRate: 10000
          name: Stress
    plugins:
        ensure: {}
        apdex: {}
    apdex:
        threshold: 100
    ensure:
        thresholds:
            - http.response_time.p99: 100
            - http.response_time.p95: 75
scenarios:
    - flow:
          - loop:
                - get:
                      url: "/"
            count: 10